## Introduction to Data Science

### Introduction to Pandas

In [1]:
#import pylab
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import os
import pathlib


%matplotlib inline
#%matplotlib notebook

### Pandas Data Structures: Series

In [2]:
obj = pd.Series([4, 7, -5, 3, 5])
obj

0    4
1    7
2   -5
3    3
4    5
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3,  5])

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob       4
Steve     7
Jeff     -5
Ryan      3
Fernie    5
dtype: int64

In [6]:
obj['Bob']

4

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['c']

3

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2[obj2 < 0]

a   -5
dtype: int64

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### Pandas Data Structures: Dataframe

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [20]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [21]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [23]:
frame2['nova'] = 13
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    13
two    2001    Ohio  1.7  NaN    13
three  2002    Ohio  3.6  NaN    13
four   2001  Nevada  2.4  NaN    13
five   2002  Nevada  2.9  NaN    13

In [24]:
frame2.nova = 23
frame2

       year   state  pop debt  nova
one    2000    Ohio  1.5  NaN    23
two    2001    Ohio  1.7  NaN    23
three  2002    Ohio  3.6  NaN    23
four   2001  Nevada  2.4  NaN    23
five   2002  Nevada  2.9  NaN    23

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [26]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [28]:
#frame2.loc['three']
frame2.loc['three','state']

'Ohio'

In [29]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5  16.5    23
two    2001    Ohio  1.7  16.5    23
three  2002    Ohio  3.6  16.5    23
four   2001  Nevada  2.4  16.5    23
five   2002  Nevada  2.9  16.5    23

In [30]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   0.0    23
two    2001    Ohio  1.7   1.0    23
three  2002    Ohio  3.6   2.0    23
four   2001  Nevada  2.4   3.0    23
five   2002  Nevada  2.9   4.0    23

In [31]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt  nova
one    2000    Ohio  1.5   NaN    23
two    2001    Ohio  1.7  -1.2    23
three  2002    Ohio  3.6   NaN    23
four   2001  Nevada  2.4  -1.5    23
five   2002  Nevada  2.9  -1.7    23

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  nova  eastern
one    2000    Ohio  1.5   NaN    23     True
two    2001    Ohio  1.7  -1.2    23     True
three  2002    Ohio  3.6   NaN    23     True
four   2001  Nevada  2.4  -1.5    23    False
five   2002  Nevada  2.9  -1.7    23    False

In [33]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'nova'], dtype='object')

In [34]:
transpose = frame2.pivot(index= 'year', columns='state', values='pop') 
transpose

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [35]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [36]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [37]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [38]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [40]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [42]:
frame5 = pd.concat([frame4, frame4])
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [43]:
frame5.drop_duplicates(['Nevada'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [44]:
dates = pd.date_range("20160101", periods=10)
data = np.random.random((10,3))
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.346993  0.644023  0.832647
2016-01-02  0.572811  0.564093  0.216808
2016-01-03  0.442200  0.650678  0.410444
2016-01-04  0.164405  0.225033  0.596222
2016-01-05  0.205112  0.647010  0.140877
2016-01-06  0.373165  0.182128  0.464876
2016-01-07  0.133747  0.818564  0.421440
2016-01-08  0.826909  0.178128  0.199597
2016-01-09  0.057341  0.787933  0.235007
2016-01-10  0.810859  0.423779  0.273042

In [45]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.572811  0.564093  0.216808
2016-01-03  0.442200  0.650678  0.410444

In [46]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.164405  0.225033  0.596222
2016-01-05  0.205112  0.647010  0.140877
2016-01-06  0.373165  0.182128  0.464876
2016-01-07  0.133747  0.818564  0.421440

In [47]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.346993  0.832647
2016-01-02  0.572811  0.216808

In [48]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.164405  0.225033
2016-01-05  0.205112  0.647010

In [49]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.393354   0.512137   0.379096
std     0.272352   0.244527   0.213516
min     0.057341   0.178128   0.140877
25%     0.174581   0.274720   0.221358
50%     0.360079   0.604058   0.341743
75%     0.540159   0.649761   0.454017
max     0.826909   0.818564   0.832647

In [50]:
df.sort_index(axis=0, ascending=False,) # inplace=True)

             Column1   Column2   Column3
2016-01-10  0.810859  0.423779  0.273042
2016-01-09  0.057341  0.787933  0.235007
2016-01-08  0.826909  0.178128  0.199597
2016-01-07  0.133747  0.818564  0.421440
2016-01-06  0.373165  0.182128  0.464876
2016-01-05  0.205112  0.647010  0.140877
2016-01-04  0.164405  0.225033  0.596222
2016-01-03  0.442200  0.650678  0.410444
2016-01-02  0.572811  0.564093  0.216808
2016-01-01  0.346993  0.644023  0.832647

In [51]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-08  0.826909  0.178128  0.199597
2016-01-06  0.373165  0.182128  0.464876
2016-01-04  0.164405  0.225033  0.596222
2016-01-10  0.810859  0.423779  0.273042
2016-01-02  0.572811  0.564093  0.216808
2016-01-01  0.346993  0.644023  0.832647
2016-01-05  0.205112  0.647010  0.140877
2016-01-03  0.442200  0.650678  0.410444
2016-01-09  0.057341  0.787933  0.235007
2016-01-07  0.133747  0.818564  0.421440

In [52]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160101", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [53]:
df1.head()

             ColumnA   ColumnB
2016-01-01  0.804173  0.942827
2016-01-02  0.412910  0.799211
2016-01-03  0.811204  0.141865
2016-01-04  0.142745  0.115098
2016-01-05  0.350999  0.262944

In [54]:
df2.head()

             ColumnC   ColumnD
2016-01-01  0.813413  0.057753
2016-01-02  0.329228  0.673898
2016-01-03  0.870813  0.323186
2016-01-04  0.684819  0.526065
2016-01-05  0.591987  0.350975

In [55]:
df1.join(df2)

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.804173  0.942827  0.813413  0.057753
2016-01-02  0.412910  0.799211  0.329228  0.673898
2016-01-03  0.811204  0.141865  0.870813  0.323186
2016-01-04  0.142745  0.115098  0.684819  0.526065
2016-01-05  0.350999  0.262944  0.591987  0.350975
2016-01-06  0.224452  0.157200  0.849220  0.667343

In [56]:
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Profit', 
                               'Loss'], index=dates)

In [57]:
df3.head()

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss
2016-01-01  0.804173  0.942827  0.813413  0.057753     Profit
2016-01-02  0.412910  0.799211  0.329228  0.673898       Loss
2016-01-03  0.811204  0.141865  0.870813  0.323186     Profit
2016-01-04  0.142745  0.115098  0.684819  0.526065     Profit
2016-01-05  0.350999  0.262944  0.591987  0.350975     Profit

In [58]:
df3.groupby('ProfitLoss').mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.318681  0.478205  0.589224  0.670621
Profit      0.527280  0.365684  0.740258  0.314495

### Pandas Functions

#### idmin & idmax

In [59]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-03 00:00:00', freq='D')

In [60]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-04 00:00:00', freq='D')

ne()

In [61]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]
df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

In [62]:
df['x'].ne(0).idxmax()

6

In [63]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [64]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

#### Parallelization on Apply

using [Swifter](https://github.com/jmcarpenter2/swifter)

In [70]:
import swifter

In [65]:
pdf = pd.DataFrame(np.random.randint(0,100,size=(25000000, 4)),columns=list('abcd'))

In [66]:
pdf.head()

    a   b   c   d
0  87  11  95  55
1  20  37  16  43
2  23  69  64  18
3  86   2  61  76
4  71  34  99  90

In [67]:
def func(a,b):
    if a>50:
        return True
    elif b>75:
        return True
    else:
        return False

In [69]:
%%time

pdf['e'] = pdf.apply(lambda x : func(x['a'],x['b']),axis=1)

CPU times: user 8min 3s, sys: 262 ms, total: 8min 3s
Wall time: 8min 4s

In [71]:
%%time

pdf['e'] = pdf.swifter.apply(lambda x : func(x['a'],x['b']),axis=1)

HBox(children=(IntProgress(value=0, description='Dask Apply', max=16, style=ProgressStyle(description_width='i…

CPU times: user 3.05 s, sys: 2.64 s, total: 5.69 s
Wall time: 4min 33s